// https://en.wikipedia.org/wiki/Hiragana#Table_of_hiragana

// prettier-ignore
export const hiragana = {
	monographs: [
		'あ', 'い', 'う', 'え', 'お',
		'か', 'き', 'く', 'け', 'こ',
		'さ', 'し', 'す', 'せ', 'そ',
		'た', 'ち', 'つ', 'て', 'と',
		'な', 'に', 'ぬ', 'ね', 'の',
		'ま', 'み', 'む', 'め', 'も',
		'は', 'ひ', 'ふ', 'へ', 'ほ',
		'や',       'ゆ',      'よ',
		'ら', 'り', 'る', 'れ', 'ろ',
		'わ',                  'を',
		'ん',
	],
	diacritics: [
		'が', 'ぎ', 'ぐ', 'げ', 'ご',
		'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
		'だ', 'ぢ', 'づ', 'で', 'ど',
		'ば', 'び', 'ぶ', 'べ', 'ぼ',
		'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ'
	],
	digraphs: [
		'きゃ', 'きゅ', 'きょ',
		'しゃ', 'しゅ', 'しょ',
		'ちゃ', 'ちゅ', 'ちょ',
		'にゃ', 'にゅ', 'にょ',
		'ひゃ', 'ひゅ', 'ひょ',
		'みゃ', 'みゅ', 'みょ',
		'りゃ', 'りゅ', 'りょ'
	],
	digraphs_diacritics: [
		'ぎゃ', 'ぎゅ', 'ぎょ',
		'じゃ', 'じゅ', 'じょ',
		// ["ぢゃ", "ぢゅ", "ぢょ"],
		'びゃ', 'びゅ', 'びょ',
		'ぴゃ', 'ぴゅ', 'ぴょ'
	],
	sounds: {
    'あ': ['a'],   'い': ['i'],   'う': ['ɯ'],   'え': ['e'],   'お': ['o'],
    'か': ['ka'],  'き': ['ki'],  'く': ['kɯ'],  'け': ['ke'],  'こ': ['ko'],
    'さ': ['sa'],  'し': ['ɕi'],  'す': ['sɯ'],  'せ': ['se'],  'そ': ['so'],
    'た': ['ta'],  'ち': ['tɕi'], 'つ': ['tsɯ'], 'て': ['te'],  'と': ['to'],
    'な': ['na'],  'に': ['ɲi'],  'ぬ': ['nɯ'],  'ね': ['ne'],  'の': ['no'],
    'ま': ['ma'],  'み': ['mi'],  'む': ['mɯ'],  'め': ['me'],  'も': ['mo'],
    'は': ['ha'],  'ひ': ['çi'],  'ふ': ['ɸɯ'],  'へ': ['he'],  'ほ': ['ho'],
    'や': ['ja'],                 'ゆ': ['jɯ'],                'よ': ['jo'],
    'ら': ['ɾa'],  'り': ['ɾi'],  'る': ['ɾɯ'],  'れ': ['ɾe'],  'ろ': ['ɾo'],
    'わ': ['wa'],                                        'を': ['o'],
    'ん': ['n'],

		'が': ['ɡa'],     'ぎ': ['ɡi'],    'ぐ': ['ɡɯ'],     'げ': ['ɡe'],     'ご': ['ɡo'],
    'ざ': ['(d)za'],  'じ': ['(d)ʑi'], 'ず': ['(d)zɯ'],  'ぜ': ['(d)ze'],  'ぞ': ['(d)zo'],
    'だ': ['da'],     'ぢ': ['(d)ʑi'], 'づ': ['(d)zɯ'],  'で': ['de'],     'ど': ['do'],
    'ば': ['ba'],     'び': ['bi'],    'ぶ': ['bɯ'],     'べ': ['be'],     'ぼ': ['bo'],
    'ぱ': ['pa'],     'ぴ': ['pi'],    'ぷ': ['pɯ'],     'ぺ': ['pe'],     'ぽ': ['po'],

		'きゃ': ['kʲa'], 'きゅ': ['kʲɯ'], 'きょ': ['kʲo'],
    'しゃ': ['ɕa'],  'しゅ': ['ɕɯ'],  'しょ': ['ɕo'],
    'ちゃ': ['tɕa'], 'ちゅ': ['tɕɯ'], 'ちょ': ['tɕo'],
    'にゃ': ['ɲa'],  'にゅ': ['ɲɯ'],  'にょ': ['ɲo'],
    'ひゃ': ['ça'],  'ひゅ': ['çɯ'],  'ひょ': ['ço'],
    'みゃ': ['mʲa'], 'みゅ': ['mʲɯ'], 'みょ': ['mʲo'],
    'りゃ': ['ɾʲa'], 'りゅ': ['ɾʲɯ'], 'りょ': ['ɾʲo'],

		'ぎゃ': ['ɡʲa'],   'ぎゅ': ['ɡʲɯ'],   'ぎょ': ['ɡʲo'],
    'じゃ': ['(d)ʑa'], 'じゅ': ['(d)ʑɯ'], 'じょ': ['(d)ʑo'],
    // 'ぢゃ': ['(d)ʑa'], 'ぢゅ': ['(d)ʑɯ'], 'ぢょ': ['(d)ʑo'],
    'びゃ': ['bʲa'],   'びゅ': ['bʲɯ'],   'びょ': ['bʲo'],
    'ぴゃ': ['pʲa'],   'ぴゅ': ['pʲɯ'],   'ぴょ': ['pʲo']
	}
};

export const exceptional_answers = new Map([
  ["し", ["shi", "si"]],
  ["ち", ["chi", "ti"]],
  ["つ", ["tsu", "tu"]],
  ["ふ", ["fu", "hu"]],

  ["じ", ["ji", "zi"]],
  ["ぢ", ["di", "ji"]],
  ["づ", ["du", "zu"]],

  ["じゃ", ["ja", "jya"]],
  ["じゅ", ["ju", "jyu"]],
  ["じょ", ["jo", "jyo"]],
]);

// https://en.wikipedia.org/wiki/Greek_alphabet
// https://en.wikipedia.org/wiki/Greek_orthography#Digraphs_and_diphthongs
// https://www.foundalis.com/lan/grkalpha.htm
// prettier-ignore
export const greek = {
	lower_monographs: [
		'α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'σ', 'ς',
		'τ', 'υ', 'φ', 'χ', 'ψ', 'ω'
	],
	upper_monographs: [ // the only differences in the upper case characters is that 'S' appears once
		'Α', 'Β', 'Γ', 'Δ', 'Ε', 'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Ο', 'Π', 'Ρ', 'Σ', 'Τ',
		'Υ', 'Φ', 'Χ', 'Ψ', 'Ω'
  ], 
	digraphs: [
		'ου', 'αυ', 'ευ', 'ηυ', 'μπ', 'ντ', 'γκ', 'γγ', 'τζ', 'γχ', 'γξ', 'αι', 'υι', 'οι', 'ει'
	],
  names: {
    'α': ['alpha'],    'β': ['beta'],     'γ': ['gamma'],              'δ': ['delta'],
    'ε': ['epsilon'],  'ζ': ['zeta'],     'η': ['eta'],                'θ': ['theta'],
    'ι': ['iota'],     'κ': ['kappa'],    'λ': ['lambda', 'lamda'],    'μ': ['mu'],
    'ν': ['nu'],       'ξ': ['xi'],       'ο': ['omicron', 'omikron'], 'π': ['pi'],
    'ρ': ['rho'],      'σ': ['sigma'],    'ς': ['sigma'],              'τ': ['tau'], 
		'υ': ['upsilon'],  'φ': ['phi'],      'χ': ['chi'],                'ψ': ['psi'], 
		'ω': ['omega']
  },
  transcriptions: { // Traditional Latin transliteration
    'α': ['a'],           'β': ['v'],           'γ': ['g'],           'δ': ['d'],
    'ε': ['e'],           'ζ': ['z'],           'η': ['i'],           'θ': ['th'],
    'ι': ['i'],           'κ': ['k'],           'λ': ['l'],           'μ': ['m'],
    'ν': ['n'],           'ξ': ['x', 'ks'],     'ο': ['o'],           'π': ['p'],
    'ρ': ['r', 'rh'],     'σ': ['s'],           'ς': ['s'],           'τ': ['t'],
		'υ': ['y', 'u'],      'φ': ['ph', 'f'],     'χ': ['kh'],          'ψ': ['ps'],
		'ω': ['o'],           'ου': ['u'],          'αυ': ['af', 'av'],   'ευ': ['ef', 'ev'],
		'ηυ': ['if', 'iv'],   'μπ': ['b', 'mb'],    'ντ': ['d', 'nd'],    'γκ': ['g', 'ng'],
		'γγ': ['g', 'ng', 'ngh'],                   'τζ': ['dz', 'tz'],   'ωυ': ['oi'],
		'γχ': ['ngkh', 'nkh'],         'γξ': ['nx', 'ngks'],             'αι': ['e'],
		'υι': ['i'],          'οι': ['i'],          'ει': ['i']
  },
  pronunciations: {
    'α': ['f', 'a', 'ther'],        'β': ['', 'v', 'ote'],        'γ': ['la','g','o (Spanish)'],
		'δ': ['', 'th', 'en'],          'ε': ['overl', 'a', 'y'],     'ζ': ['', 'z', 'oo'],
		'η': ['mach', 'i', 'ne (short)'],   'θ': ['', 'th', 'in'],    'ι': ['mach', 'i', 'ne (short)'],
		'κ': ['ma', 'k', 'e'],          'λ': ['', 'l', 'antern'],     'μ': ['', 'm', 'usic'],
		'ν': ['', 'n', 'et'],           'ξ': ['fo', 'x', ''],         'ο': ['g', 'o', 't'],
		'π': ['s', 'p', 'ot'],    'ρ': ['ca', 'rr', 'o (Spanish)'],   'σ': ['', 's', 'oft'],
		'ς': ['', 's', 'oft'],          'τ': ['s', 't', 'oke'],       'υ': ['mach', 'i', 'ne (short)'],
		'φ': ['', 'f', 'ive'],          'χ': ['lo', 'ch', ' (Scottish)'],
		'ψ': ['la', 'ps', 'e'],         'ω': ['l', 'aw', ''],
		'μπ': ['', 'b', 'ee (beginning of words); otherwise', 'co', 'mb', 'at'],
		'ντ': ['', 'd', 'og (beginning of words); otherwise', 'la', 'nd', ''],
		'γκ': ['', 'g', 'arage (beginning of words); otherwise', 'fi', 'ng', 'er'],
		'γγ': ['fu', 'ng', 'us'],
		'τζ': ['ro', 'ds', ''],
		'ωυ': ['oi'],
		'γχ': ['ki', 'ng', '(=γ, followed χ=kh)'],
		'γξ': ['ly', 'nx', ''],
		'αι': ['p', 'e', 't'],
		'υι': ['m', 'ee', 't (short)'],
		'οι': ['m', 'ee', 't (short)'],
		'ει': ['m', 'ee', 't (short)'],
		'ου': ['b', 'oo', 't'],
		'αυ': ['h', 'av', 'e (before voiced consonants); otherwise', '', 'af', 'ter (before unvoiced consonants)'],
		'ευ': ['', 'ev', 'ery before voiced consonants or any vowel; otherwise', '', 'ef', 'fort (before unvoiced consonants)'],
		'ηυ': ['', 'ev', 'ening (before voiced consonants or any vowel); otherwise', 'b', 'eef', ' (before unvoiced consonants)']
  },

	sounds: {
		'α': ['a'], 'β': ['v'], 'γ': ['ɣ'], 'δ': ['ð'], 'ε': ['e'], 'ζ': ['z'],
    'η': ['i'], 'θ': ['θ'], 'ι': ['i', 'ç', 'ʝ', 'ɲ'], 'κ': ['k', 'c'], 'λ': ['l'], 'μ': ['m'],
    'ν': ['n'], 'ξ': ['ks'], 'ο': ['o'], 'π': ['p'], 'ρ': ['r', 'ɾ'], 'σ': ['s', 'z'],
    'ς': ['s'], 'τ': ['t'], 'υ': ['i'], 'φ': ['f'], 'χ': ['x', 'ç'], 'ψ': ['ps'],
    'ω': ['o'], 'ου': ['u'], 'αυ': ['af', 'av'], 'ευ': ['ef', 'ev'], 'ηυ': ['if', 'iv'],
		'μπ': ['b', 'mb'], 'ντ': ['d', 'nd'], 'γκ': ['g', 'ŋg'], 'γγ': ['g,', 'ŋg', 'ŋɣ'], 'τζ': ['dz'], 
		'γχ': ['nç', 'nx'], 'γξ': ['ŋks'], 'αι': ['e'], 'υι': ['i'], 'οι': ['i'], 'ει': ['i']
	}
}

// prettier-ignore
export const cyrillic = {
	// https://en.wikipedia.org/wiki/Bulgarian_alphabet
	languages: {
		bulgarian: [
			'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т',
			'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ь', 'ю', 'я'
		],
		// https://en.wikipedia.org/wiki/Russian_alphabet
		russian: [
			'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 
			'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я'
		],
		// https://en.wikipedia.org/wiki/Serbian_Cyrillic_alphabet
		serbian: [
			'а', 'б', 'в', 'г', 'д', 'ђ', 'е', 'ж', 'з', 'и', 'ј', 'к', 'л', 'љ', 'м', 'н', 'њ', 'о', 'п', 
			'р', 'с', 'т', 'ћ', 'у', 'ф', 'х', 'ц', 'ч', 'џ', 'ш'
		],
		// https://en.wikipedia.org/wiki/Ukrainian_alphabet
		ukrainian: [
			'а', 'б', 'в', 'г', 'ґ', 'д', 'е', 'є', 'ж', 'з', 'и', 'і', 'ї', 'й', 'к', 'л', 'м', 'н',
			'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ю', 'я'
		]
	},
	// transcriptions
	transcriptions: {
		bulgarian: {
			'а': ['a'],        'б': ['b'],        'в': ['v'],        'г': ['g'],        'д': ['d'],
			'е': ['e'],			 	 'ж': ['zh'],       'з': ['z'],        'и': ['i'],        'й': ['y', 'i'],
			'к': ['k'],        'л': ['l'], 			  'м': ['m'],        'н': ['n'],        'о': ['o'],
			'п': ['p'],        'р': ['r'],        'с': ['s'], 			 'т': ['t'],        'у': ['u'],
			'ф': ['f'],        'х': ['kh'],       'ц': ['ts', 'c'],  'ч': ['ch'],       'ш': ['sh'],
			'щ': ['sht'],      'ъ': ['a', 'uh'],  'ь': ['y', 'i'],   'ю': ['yu', 'ju'], 'я': ['ya', 'ja']
		},
		russian: {
			'а': ['a'],        'б': ['b'],        'в': ['v'],        'г': ['g'],        'д': ['d'],
			'е': ['ye', 'e'],  'ё': ['yo'],       'ж': ['zh'],       'з': ['z'],        'и': ['i'],
			'й': ['y', 'i'],   'к': ['k'],        'л': ['l'], 			 'м': ['m'],        'н': ['n'],
			'о': ['o'],        'п': ['p'],        'р': ['r'],        'с': ['s'], 			  'т': ['t'],
			'у': ['u'],        'ф': ['f'],        'х': ['kh', 'h'],  'ц': ['ts', 'c'],  'ч': ['ch'],
			'ш': ['sh'],			 'щ': ['shch', 'sch'],                 'ъ': ["-", ''],    'ы': ['y'],
			'ь': ['-', ''],    'э': ['e'],        'ю': ['yu', 'ju'], 'я': ['ya', 'ja']
		},
		serbian: {
			'а': ['a'],        'б': ['b'],        'в': ['v'],        'г': ['g'],        'д': ['d'],
			'ђ': ['dj'],       'е': ['e'],			  'ж': ['zh'],       'з': ['z'],        'и': ['i'],
			'ј': ['y', 'i'],   'к': ['k'],        'л': ['l'], 			 'љ': ['lj', 'ly'], 'м': ['m'],
			'н': ['n'],        'њ': ['nj', 'ny'], 'о': ['o'],        'п': ['p'],        'р': ['r'],
			'с': ['s'], 			 'т': ['t'],        'ћ': ['tsh'],      'у': ['u'],        'ф': ['f'],
			'х': ['kh'],       'ц': ['ts', 'c'],  'ч': ['ch'],       'џ': ['dzh'],      'ш': ['sh']
		},
		ukrainian: {
			'а': ['a'],   'б': ['b'],   'в': ['v'],   'г': ['h'],    'ґ': ['g'],
			'д': ['d'],   'е': ['e'],   'є': ['ye', 'ie'], 'ж': ['zh'], 'з': ['z'],
			'и': ['y'],   'і': ['i'],   'ї': ['yi', 'i'],  'й': ['y', 'i'], 'к': ['k'],
			'л': ['l'],   'м': ['m'],   'н': ['n'],   'о': ['o'],    'п': ['p'],
			'р': ['r'],   'с': ['s'],   'т': ['t'],   'у': ['u'],    'ф': ['f'],
			'х': ['kh'],  'ц': ['ts'],  'ч': ['ch'],  'ш': ['sh'],  'щ': ['shch'],
			'ь': ['-', ''], 'ю': ['yu', 'iu'], 'я': ['ya', 'ia']
		}
	},
	// pronunciations : ['x','y','z'] -> y as in xyz
	pronunciations: {
		bulgarian: {
			'а': ['f', 'a', 'ther'], 'б': ['', 'b', 'ug'], 'в': ['', 'v', 'et'], 'г': ['', 'g', 'ood'],
			'д': ['', 'd', 'og'], 'е': ['b', 'e', 'st'], 'ж': ['trea', 's', 'ure'], 'з': ['', 'z', 'oo'],
			'и': ['mach', 'i', 'ne'], 'й': ['', 'y', 'es'], 'к': ['', 'k', 'ick'], 'л': ['ca', 'll', ''],
			'м': ['', 'm', 'an'], 'н': ['', 'n', 'ormal'], 'о': ['', 'o', 'rder'], 'п': ['', 'p', 'et'],
			'р': ['pe', 'rr', 'o (rolled)'], 'с': ['', 's', 'ound'], 'т': ['s', 't', 'ick'],
			'у': ['b', 'oo', 't'], 'ф': ['', 'f', 'ood'], 'х': ['lo', 'ch', ' (Scottish)'],
			'ц': ['fi', 'ts', ''], 'ч': ['', 'ch', 'ip'], 'ш': ['', 'sh', 'ot'], 'щ': ['', 'sht', 'ick'],
			'ъ': ['t', 'u', 'rn'], 'ь': ['can', 'y', 'on'], 'ю': ['', 'you', 'th'], 'я': ['', 'ya', 'k']
		},
		russian: {
			'а': ['f', 'a', 'ther'], 'б': ['', 'b', 'ed'], 'в': ['', 'v', 'ine'], 'г': ['', 'g', 'o'],
			'д': ['', 'd', 'o'], 'е': ['', 'ye', 's'], 'ё': ['', 'yo', 'ur'], 'ж': ['mea', 's', 'ure'],
			'з': ['', 'z', 'ap'], 'и': ['pol', 'i', 'ce'], 'й': ['to', 'y', ''], 'к': ['', 'k', 'ept'],
			'л': ['fee', 'l', ''], 'м': ['', 'm', 'ap'], 'н': ['', 'n', 'ot'], 'о': ['m', 'o', 're'],
			'п': ['', 'p', 'anic'], 'р': ['pe', 'rr', 'o (rolled)'], 'с': ['', 's', 'et'],
			'т': ['', 't', 'op'], 'у': ['t', 'oo', 'l'], 'ф': ['', 'f', 'ace'],
			'х': ['lo', 'ch', ' (Scottish)'], 'ц': ['si', 'ts', ''], 'ч': ['', 'ch', 'eck'],
			'ш': ['hu', 'sh', ''], 'щ': ['', 'sh', 'ips'],
			'ъ': ['silent, prevents palatalization of the preceding consonant', '', ''], 
			'ы': ['ros', 'e', 's'], 'ь': ['silent, palatalizes the preceding consonant', '', ''],
			'э': ['m', 'e', 't'], 'ю': ['', 'u', 'se'], 'я': ['', 'ya', 'rd']
		},
		serbian: {
			'а': ['f', 'a', 'ther'], 'б': ['', 'b', 'oy'], 'в': ['', 'v', 'ictory'], 'г': ['', 'g', 'o'],
			'д': ['', 'd', 'og'], 'ђ': ['', 'dj', 'uke'], 'е': ['p', 'e', 't'], 'ж': ['mea', 's', 'ure'],
			'з': ['', 'z', 'oo'], 'и': ['mach', 'i', 'ne'], 'ј': ['', 'y', 'es'], 'к': ['', 'k', 'ite'],
			'л': ['', 'l', 'amp'], 'љ': ['mil', 'li', 'on'], 'м': ['', 'm', 'oon'], 'н': ['', 'n', 'o'],
			'њ': ['on', 'ni', 'on'], 'о': ['f', 'o', 'r'], 'п': ['', 'p', 'ot'],
			'р': ['pe', 'rr', 'o (rolled)'], 'с': ['', 's', 'un'], 'т': ['', 't', 'op'],
			'ћ': ['', 't', 'une'], 'у': ['r', 'u', 'ler'], 'ф': ['', 'f', 'un'],
			'х': ['Ba','ch',', Johann Sebastian'], 'ц': ['', 'ts', 'ar'], 'ч': ['', 'ch', 'ess'],
			'џ': ['', 'j', 'ungle'], 'ш': ['', 'sh', 'oe']
		},
		ukrainian: {
			'а': ['f', 'a', 'ther'], 'б': ['', 'b', 'ed'], 'в': ['', 'v', 'ine'],
			'г': ['', 'h', 'ello (voiced)'], 'ґ': ['', 'g', 'o'], 'д': ['', 'd', 'og'],
			'е': ['b', 'e', 'd'], 'є': ['', 'ye', 's'], 'ж': ['mea', 's', 'ure'],
			'з': ['', 'z', 'oo'], 'и': ['s', 'i', 't'], 'і': ['mach', 'i', 'ne'],
			'ї': ['', 'yee', 's'], 'й': ['', 'y', 'es'], 'к': ['', 'k', 'ite'],
			'л': ['', 'l', 'amp'], 'м': ['', 'm', 'an'], 'н': ['', 'n', 'o'],
			'о': ['m', 'o', 're'], 'п': ['', 'p', 'ot'], 'р': ['pe', 'rr', 'o (rolled)'],
			'с': ['', 's', 'un'], 'т': ['', 't', 'op'], 'у': ['b', 'oo', 't'],
			'ф': ['', 'f', 'un'], 'х': ['lo', 'ch', ' (Scottish)'], 'ц': ['si', 'ts', ''],
			'ч': ['', 'ch', 'ess'], 'ш': ['', 'sh', 'oe'], 'щ': ['', 'shch', ' (sh + ch)'],
			'ь': ['silent, softens the preceding consonant', '', ''],
			'ю': ['', 'yu', 'le'], 'я': ['', 'ya', 'rd']
		}
	},

	sounds: {
		bulgarian: {
			'а': ['a', 'ɐ', 'ə'], 'б': ['b'], 'в': ['v', 'f'], 'г': ['ɡ'], 'д': ['d'],
			'е': ['ɛ'], 'ж': ['ʒ', 'ʃ'], 'з': ['z', 's'], 'и': ['i'], 'й': ['j'],
			'к': ['k', 'g'], 'л': ['l', 'ʎ', 'ɫ'], 'м': ['m'], 'н': ['n'], 'о': ['ɔ', 'o'],
			'п': ['p'], 'р': ['r'], 'с': ['s'], 'т': ['t'], 'у': ['u', 'ʊ'],
			'ф': ['f'], 'х': ['x'], 'ц': ['ts'], 'ч': ['tʃ'], 'ш': ['ʃ'],
			'щ': ['ʃt'], 'ъ': ['ɤ', 'ɐ'], 'ь': ['ʲ'], 'ю': ['ju'], 'я': ['ja']
		},
		russian: {
			'а': ['a'], 'б': ['b', 'bʲ'], 'в': ['v', 'vʲ'], 'г': ['ɡ', 'gʲ'], 'д': ['d', 'dʲ'],
			'е': ['je', 'e'], 'ё': ['jo', 'ʲɵ'], 'ж': ['ʐ'], 'з': ['z', 'zʲ'], 'и': ['i', 'ɨ'],
			'й': ['j'], 'к': ['k', 'kʲ'], 'л': ['ɫ', 'lʲ'], 'м': ['m', 'mʲ'], 'н': ['n', 'nʲ'],
			'о': ['o'], 'п': ['p', 'pʲ'], 'р': ['r', 'rʲ'], 'с': ['s', 'sʲ'], 'т': ['t', 'tʲ'],
			'у': ['u'], 'ф': ['f', 'fʲ'], 'х': ['x', 'xʲ'], 'ц': ['ts'], 'ч': ['tɕ'],
			'ш': ['ʂ'], 'щ': ['ɕː', 'ɕ'], 'ъ': ['∅'], 'ы': ['ɨ'], 'ь': ['ʲ'],
			'э': ['ɛ', 'e'], 'ю': ['ju'], 'я': ['ja']
		},
		serbian: {
			'а': ['ä'], 'б': ['b'], 'в': ['v'], 'г': ['ɡ'], 'д': ['d'],
			'ђ': ['dʑ'], 'е': ['e̞'], 'ж': ['ʐ'], 'з': ['z'], 'и': ['i'],
			'ј': ['j'], 'к': ['k'], 'л': ['l'], 'љ': ['ʎ'], 'м': ['m'],
			'н': ['n'], 'њ': ['ɲ'], 'о': ['ɔ̝'], 'п': ['p'], 'р': ['ɾ'],
			'с': ['s'], 'т': ['t'], 'ћ': ['tɕ'], 'у': ['u'], 'ф': ['f'],
			'х': ['x'], 'ц': ['ts'], 'ч': ['tʂ'], 'џ': ['dʐ'], 'ш': ['ʂ']
		},
		ukrainian: {
			'а': ['a'], 'б': ['b'], 'в': ['ʋ', 'w'], 'г': ['ɦ'], 'ґ': ['ɡ'],
			'д': ['d'], 'е': ['ɛ'], 'є': ['jɛ'], 'ж': ['ʒ'], 'з': ['z'],
			'и': ['ɪ'], 'і': ['i'], 'ї': ['ji'], 'й': ['j'], 'к': ['k'],
			'л': ['l'], 'м': ['m'], 'н': ['n'], 'о': ['ɔ'], 'п': ['p'],
			'р': ['r'], 'с': ['s'], 'т': ['t'], 'у': ['u'], 'ф': ['f'],
			'х': ['x'], 'ц': ['ts'], 'ч': ['tʃ'], 'ш': ['ʃ'], 'щ': ['ʃtʃ'],
			'ь': ['ʲ'], 'ю': ['ju'], 'я': ['ja']
		}
	}, 
}

// prettier-ignore
export const persoarabic = {
	languages: {
		arabic: ['ا', 'ب', 'ت', 'ث', 'ج', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 
						'ع', 'غ', 'ف', 'ق', 'ك', 'ل', 'م', 'ن', 'ه', 'و', 'ي'],

		persian: ['ا', 'ب', 'پ', 'ت', 'ث', 'ج', 'چ', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'ژ', 'س', 'ش', 'ص',
						'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ک', 'گ', 'ل', 'م', 'ن', 'و', 'ه', 'ی'],

		urdu:  ['ا', 'ب', 'پ', 'ت', 'ٹ', 'ث', 'ج', 'چ', 'ح', 'خ', 'د', 'ڈ', 'ذ', 'ر', 'ڑ', 'ز', 'ژ', 
						'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ک', 'گ', 'ل', 'م', 'ن', 'ں', 'و',
						'ہ', 'ھ', 'ی', 'ے', 'ء']
	},

	transcriptions: {
		arabic: {
			standard: {
				'ا': ['a', 'aa'],     'ب': ['b'],           'ت': ['t'],           'ث': ['th'],
				'ج': ['j'],           'ح': ['h'],           'خ': ['kh'],          'د': ['d'],
				'ذ': ['dh'],          'ر': ['r'],           'ز': ['z'],           'س': ['s'],
				'ش': ['sh'],          'ص': ['s'],           'ض': ['d'],           'ط': ['t'],
				'ظ': ['z', 'dh'],     'ع': ["'", 'aa'],     'غ': ['gh'],          'ف': ['f'],    
				'ق': ['q'],           'ك': ['k'],           'ل': ['l'],           'م': ['m'],
				'ن': ['n'],           'ه': ['h'],           'و': ['w', 'u'],      'ي': ['y', 'i']
			},

			egyptian: {
				'ا': ['a', 'aa'],       'ب': ['b'],        'ت': ['t'],        'ث': ['th'],
				'ج': ['g'],             'ح': ['h'],        'خ': ['kh'],       'د': ['d'],
				'ذ': ['dh'],            'ر': ['r'],        'ز': ['z'],        'س': ['s'],
				'ش': ['sh'],            'ص': ['s'],        'ض': ['d'],        'ط': ['t'],
				'ظ': ['z', 'dh'],       'ع': ["'", 'aa'],  'غ': ['gh'],       'ف': ['f'],
				'ق': ['ʔ'],             'ك': ['k', 'ch'],  'ل': ['l'],        'م': ['m'],
				'ن': ['n'],             'ه': ['h'],        'و': ['w', 'u'],   'ي': ['y', 'i']
			},

			levantine: {
				'ا': ['a', 'aa'],       'ب': ['b'],       'ت': ['t'],        'ث': ['t', 's'],
				'ج': ['zh'],            'ح': ['h'],       'خ': ['kh'],       'د': ['d'],
				'ذ': ['d', 'z'],        'ر': ['r'],       'ز': ['z'],        'س': ['s'],
				'ش': ['sh'],            'ص': ['s'],       'ض': ['d'],        'ط': ['t'],
				'ظ': ['z', 'dh'],       'ع': ["'", 'aa'], 'غ': ['gh'],       'ف': ['f'],
				'ق': ['-'],             'ك': ['k'],       'ل': ['l'],        'م': ['m'],
				'ن': ['n'],             'ه': ['h'],       'و': ['w', 'u'],   'ي': ['y', 'i']
			},

			gulf: {
				'ا': ['a', 'aa'],   'ب': ['b'],         'ت': ['t'],         'ث': ['th'],
				'ج': ['y', 'j'],    'ح': ['h'],         'خ': ['kh'],        'د': ['d'],
				'ذ': ['dh'],        'ر': ['r'],         'ز': ['z'],         'س': ['s'],
				'ش': ['sh'],        'ص': ['s'],         'ض': ['dh'],        'ط': ['t'],
				'ظ': ['z', 'dh'],   'ع': ["'", 'aa'],   'غ': ['gh', 'q'],   'ف': ['f'],
				'ق': ['g', 'j'],    'ك': ['k', 'ch'],   'ل': ['l'],         'م': ['m'],
				'ن': ['n'],         'ه': ['h'],         'و': ['w', 'u'],    'ي': ['y', 'i']
			}
		},

		persian: {
			'ا': ['a', 'aa'],   'ب': ['b'],           'پ': ['p'],        'ت': ['t'],
			'ث': ['th'],        'ج': ['j'],           'چ': ['ch'],       'ح': ['h'],
			'خ': ['kh'],        'د': ['d'],           'ذ': ['dh'],       'ر': ['r'],
			'ز': ['z'],         'ژ': ['zh'],          'س': ['s'],        'ش': ['sh'],
			'ص': ['s'],         'ض': ['d'],           'ط': ['t'],        'ظ': ['z', 'dh'],
			'ع': ["'", 'aa'],   'غ': ['gh'],          'ف': ['f'],        'ق': ['q'],
			'ک': ['k'],         'گ': ['g'],           'ل': ['l'],        'م': ['m'],
			'ن': ['n'],         'و': ['v', 'u', 'o'], 'ه': ['h'],        'ی': ['y', 'i', 'ee']
		},

		urdu: {
			'ا': ['a', 'aa'],     'ب': ['b'],           'پ': ['p'],           'ت': ['t'],
			'ٹ': ['ṭ'],           'ث': ['th'],          'ج': ['j'],           'چ': ['ch'],
			'ح': ['h'],           'خ': ['kh'],          'د': ['d'],           'ڈ': ['dd'],//ḍ
			'ذ': ['dh'],          'ر': ['r'],       	  'ڑ': ['ṛ'],           'ز': ['z'],
			'ژ': ['zh'],          'س': ['s'],       	  'ش': ['sh'],          'ص': ['s'],
			'ض': ['d'],           'ط': ['t'],           'ظ': ['z', 'dh'],     'ع': ["'", 'aa'],
			'غ': ['gh'],          'ف': ['f'],           'ق': ['q'],           'ک': ['k'],
			'گ': ['g'],           'ل': ['l'],           'م': ['m'],           'ن': ['n'],
			'ں': ['n'],           'و': ['w', 'u', 'o'], 'ہ': ['h'],           'ھ': ['h'],
			'ی': ['y', 'i'],      'ے': ['e'],           'ء': ['-']
		}
	},

	sounds: {
		arabic: {
			standard: {
				'ا': ['ʔ', 'aː'],  'ب': ['b'],            'ت': ['t'],         'ث': ['θ'],
				'ج': ['dʒ'],       'ح': ['ħ'],            'خ': ['x'],         'د': ['d'],
				'ذ': ['ð'],        'ر': ['r'],            'ز': ['z'],         'س': ['s'],
				'ش': ['ʃ'],        'ص': ['sˤ'],           'ض': ['dˤ'],        'ط': ['tˤ'],
				'ظ': ['ðˤ'],       'ع': ['ʕ'],            'غ': ['ɣ'],         'ف': ['f'],    
				'ق': ['q'],        'ك': ['k'],            'ل': ['l'],         'م': ['m'],
				'ن': ['n'],        'ه': ['h'],            'و': ['w', 'uː'],    'ي': ['j', 'iː']
			},

			egyptian: {
				'ا': ['aː'],       'ب': ['b'],            'ت': ['t'],         'ث': ['s'],
				'ج': ['ɡ'],        'ح': ['ħ'],            'خ': ['x'],         'د': ['d'],
				'ذ': ['z'],        'ر': ['r'],            'ز': ['z'],         'س': ['s'],
				'ش': ['ʃ'],        'ص': ['sˤ'],           'ض': ['dˤ'],        'ط': ['tˤ'],
				'ظ': ['z'],        'ع': ['ʕ'],            'غ': ['ɣ'],         'ف': ['f'],
				'ق': ['ʔ'],        'ك': ['k'],            'ل': ['l'],         'م': ['m'],
				'ن': ['n'],        'ه': ['h'],            'و': ['w', 'u'],    'ي': ['j', 'i']
			},

			levantine: {
				'ا': ['aː'],       'ب': ['b'],            'ت': ['t'],         'ث': ['t', 's'],
				'ج': ['ʒ'],        'ح': ['ħ'],            'خ': ['x'],         'د': ['d'],
				'ذ': ['d', 'z'],   'ر': ['r'],            'ز': ['z'],         'س': ['s'],
				'ش': ['ʃ'],        'ص': ['sˤ'],           'ض': ['dˤ'],        'ط': ['dˤ', 'zˤ'],
				'ظ': ['ðˤ'],       'ع': ['ʕ'],            'غ': ['ɣ'],         'ف': ['f'],
				'ق': ['ʔ'],        'ك': ['k'],            'ل': ['l'],         'م': ['m'],
				'ن': ['n'],        'ه': ['h'],            'و': ['w', 'u'],    'ي': ['j', 'i']
			},

			gulf: {
				'ا': ['aː'],       'ب': ['b'],            'ت': ['t'],         'ث': ['θ'],
				'ج': ['j', 'dʒ'],  'ح': ['ħ'],            'خ': ['x'],         'د': ['d'],
				'ذ': ['ð'],        'ر': ['r'],            'ز': ['z'],         'س': ['s'],
				'ش': ['ʃ'],        'ص': ['sˤ'],           'ض': ['ðˤ'],        'ط': ['tˤ'],
				'ظ': ['ðˤ'],       'ع': ['ʕ'],            'غ': ['ɣ', 'q'],    'ف': ['f'],
				'ق': ['ɡ', 'dʒ'],  'ك': ['k', 'tʃ'],      'ل': ['l'],         'م': ['m'],
				'ن': ['n'],        'ه': ['h'],            'و': ['w', 'u'],    'ي': ['j', 'i']
			}
		},

		persian: {
			'ا': ['ɑː'],    'ب': ['b'],            'پ': ['p'],         'ت': ['t'],
			'ث': ['s'],     'ج': ['dʒ'],           'چ': ['tʃ'],        'ح': ['h'],
			'خ': ['x'],     'د': ['d'],            'ذ': ['z'],         'ر': ['r'],
			'ز': ['z'],     'ژ': ['ʒ'],            'س': ['s'],         'ش': ['ʃ'],
			'ص': ['s'],     'ض': ['z'],            'ط': ['t'],         'ظ': ['z'],
			'ع': ['ʔ'],     'غ': ['ɣ'],            'ف': ['f'],         'ق': ['ɣ'],
			'ک': ['k'],     'گ': ['g'],            'ل': ['l'],         'م': ['m'],
			'ن': ['n'],     'و': ['v', 'u', 'o'],  'ه': ['h'],         'ی': ['j', 'i']
		},

		urdu: {
			'ا': ['ɑː'],     'ب': ['b'],           'پ': ['p'],           'ت': ['t'],
			'ٹ': ['ʈ'],      'ث': ['s'],           'ج': ['dʒ'],          'چ': ['tʃ'],
			'ح': ['h'],      'خ': ['x'],           'د': ['d'],           'ڈ': ['ɖ'],
			'ذ': ['z'],      'ر': ['r'],           'ڑ': ['ɽ'],           'ز': ['z'],
			'ژ': ['ʒ'],      'س': ['s'],           'ش': ['ʃ'],           'ص': ['sˤ'],
			'ض': ['z'],      'ط': ['t'],           'ظ': ['z'],           'ع': ['ʕ'],
			'غ': ['ɣ'],      'ف': ['f'],           'ق': ['q'],           'ک': ['k'],
			'گ': ['ɡ'],      'ل': ['l'],           'م': ['m'],           'ن': ['n'],
			'ں': ['n'],      'و': ['ʋ', 'u'],      'ہ': ['h'],           'ھ': ['h'],
			'ی': ['j', 'i'], 'ے': ['e'],           'ء': ['ʔ']
		}
	}
}

// prettier-ignore
export const hangul = {
	glyphs: {
		initial_consonants: [
			"ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", 
			"ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"
		],
	
		vowels: [
			"ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", 
			"ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"
		],
	
		final_consonants: [
			"ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", "ㄺ", "ㄻ", 
			"ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", 
			"ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"
		]
	},

	// Weighted distrubution for generating realistic hangul syllable
	// https://www.kref.altervista.org/kreffrequency.html
	weights: {
		initial_consonants: [
			0.12124, 0.0109, 0.0378, 0.0597, 0.01, 0.0528, 0.0543, 0.0684, 0.01, 0.10884, 0.01, 
			0.14054, 0.12084, 0.01, 0.0405, 0.01, 0.0159, 0.0209, 0.09734
		],
	
		vowels:	[
			0.2353, 0.0520, 0.01, 0.01, 0.1052, 0.0173, 0.0487, 0.01, 0.1021, 0.0154, 
			0.01, 0.0163, 0.0156, 0.1007, 0.01, 0.01, 0.01, 0.01, 0.0485, 0.01, 0.1525
		],

		final_consonants: [
			0.36, 0.07615, 0.01, 0.01, 0.11789, 0.01, 0.01, 0.01, 0.06959, 0.01, 0.01, 
			0.01, 0.01, 0.01, 0.01, 0.01, 0.03859, 0.02309, 0.005, 0.01, 0.01, 
			0.10909, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01
		]
	},

	transcriptions: {
		initial: {
			ㄱ: ["g"],	    ㄲ: ["kk"],	      ㄴ: ["n"],	       ㄷ: ["d"],	        ㄸ: ["tt"],	
			ㄹ: ["r"],	    ㅁ: ["m"],	      ㅂ: ["b"],	       ㅃ: ["pp"],        ㅅ: ["s"],	
			ㅆ: ["ss"],     ㅇ: ["-", ""],    ㅈ: ["j"],	       ㅉ: ["jj"],	      ㅊ: ["ch"],	
			ㅋ: ["k"],	    ㅌ: ["t"],	      ㅍ: ["p"],	       ㅎ: ["h"],    
		},         
		final: {         
			ㄱ: ["k"],	     ㄲ: ["k"],	       ㄴ: ["n"],	       ㄷ: ["t"],	         	
			ㄹ: ["l"],       ㅁ: ["m"],	       ㅂ: ["p"],	                 	       ㅅ: ["t"],	
			ㅆ: ["t"],	     ㅇ: ["ng"],       ㅈ: ["t"],	                 	       ㅊ: ["t"],	
			ㅋ: ["k"],	     ㅌ: ["t"],	       ㅍ: ["p"],	       ㅎ: ["t"],    

			ㄳ: ["k", "ks"], ㄵ: ["n", "nj"],  ㄶ: ["n"],        ㄺ: ["k", "lk"],  ㄻ: ["m"],
			ㄼ: ["p"],       ㄽ: ["t"],        ㄾ: ["t"],        ㄿ: ["p"],        ㅀ: ["t"],
			ㅄ: ["p", "ps"]
		},   
		vowels: {
			ㅏ: ["a"],     ㅐ: ["ae"],	   ㅑ: ["ya"],	   ㅒ: ["yae"],	  ㅓ: ["eo"],	
			ㅔ: ["e"],	   ㅕ: ["yeo"],	   ㅖ: ["ye"],	   ㅗ: ["o"],	    ㅘ: ["wa"],
			ㅙ: ["wae"],	 ㅚ: ["oe"],	   ㅛ: ["yo"],	   ㅜ: ["u"],	    ㅝ: ["wo"],	
			ㅞ: ["we"],	   ㅟ: ["wi"],	   ㅠ: ["yu"],	   ㅡ: ["eu"],	  ㅢ: ["ui"],	
			ㅣ: ["i"],
		}
	}
};

export const indic = {
	languages: {
		// https://en.wikipedia.org/wiki/Devanagari
		hindi: {
			vowels: [
				'अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ऋ', 
				'ए', 'ऐ', 'ओ', 'औ', 'अं', 'अः'
			],
			consonants: [
				'क', 'ख', 'ग', 'घ', 'ङ', 
				'च', 'छ', 'ज', 'झ', 'ञ', 
				'ट', 'ठ', 'ड', 'ढ', 'ण', 
				'त', 'थ', 'द', 'ध', 'न', 
				'प', 'फ', 'ब', 'भ', 'म', 
				'य', 'र', 'ल', 'व', 
				'श', 'ष', 'स', 'ह', 
				'क़', 'ख़', 'ग़', 'ज़', 'फ़', 'ड़', 'ढ़'
		  ],
			matras: ['ा', 'ि', 'ी', 'ु', 'ू', 'ृ', 'े', 'ै', 'ो', 'ौ', 'ं', 'ः'],
			virama: '्'
		},
		// https://en.wikipedia.org/wiki/Gurmukhi
		punjabi: {
			vowels: [
				'ੳ', 'ੲ',
				'ਅ', 'ਆ', 'ਇ', 'ਈ', 'ਉ', 'ਊ', 'ਏ', 'ਐ', 'ਓ', 'ਔ'
			],
			consonants: [
				'ਸ', 'ਹ',
				'ਕ', 'ਖ', 'ਗ', 'ਘ', 'ਙ',
				'ਚ', 'ਛ', 'ਜ', 'ਝ', 'ਞ',
				'ਟ', 'ਠ', 'ਡ', 'ਢ', 'ਣ',
				'ਤ', 'ਥ', 'ਦ', 'ਧ', 'ਨ',
				'ਪ', 'ਫ', 'ਬ', 'ਭ', 'ਮ',
				'ਯ', 'ਰ', 'ਲ', 'ਵ', 'ੜ',
				'ਸ਼', 'ਖ਼', 'ਗ਼', 'ਜ਼', 'ਫ਼', 'ਲ਼', 'ਕ਼'
			],
			matras: ['ਾ', 'ਿ', 'ੀ', 'ੁ', 'ੂ', 'ੇ', 'ੈ', 'ੋ', 'ੌ', 'ਂ', 'ੰ', 'ੱ'],
			virama: '੍'
		},
	},
	transcriptions: {
		hindi: {
		  vowels: {
				अ: ['a'], आ: ['aa'], इ: ['i'], ई: ['ee'], उ: ['u'], ऊ: ['oo'], ऋ: ['ri'], 
				ए: ['e'], ऐ: ['ai'], ओ: ['o'], औ: ['au'], अं: ['am', 'an'], अः: ['ah', 'aha']
			},
			consonants: {
		  	क: ['k'], ख: ['kh'], ग: ['g'], घ: ['gh'], ङ: ['ng'], 
		  	च: ['c'], छ: ['ch'], ज: ['j'], झ: ['jh'], ञ: ['ny'], 
		  	ट: ['t'], ठ: ['th'], ड: ['d'], ढ: ['dh'], ण: ['n'], 
		  	त: ['t'], थ: ['th'], द: ['d'], ध: ['dh'], न: ['n'], 
		  	प: ['p'], फ: ['ph'], ब: ['b'], भ: ['bh'], म: ['m'], 
		  	य: ['y'], र: ['r'], ल: ['l'], व: ['v', 'w'], 
		  	श: ['sh'], ष: ['sh'], स: ['s'], ह: ['h'], 
		  	क़: ['q'], ख़: ['x'], ग़: ['g'], ज़: ['z'], फ़: ['f'], 
		  	ड़: ['r', 'd'], ढ़: ['rh', 'dh']
		  },
			matras: {
				"ा": ["aa"],
				"ि": ["i"],
				"ी": ["ee"],
				"ु": ["u"],
				"ू": ["oo"],
				"ृ": ["r", "ri"],
				"े": ["e"],
				"ै": ["ai"],
				"ो": ["o"],
				"ौ": ["au"],
				"ं": ["am", "an"],
				"ः": ["ah", "aha"],
			}
		},
		punjabi: { 
			vowels: {
				ੳ: ["-", ""], ੲ: ["-", ""],
				ਅ: ["a"], ਆ: ["aa"],
				ਇ: ["i"], ਈ: ["ee"],
				ਉ: ["u"], ਊ: ["oo"],
				ਏ: ["e"], ਐ: ["ai"],
				ਓ: ["o"], ਔ: ["au"]
			}, 
			consonants: {
				ਸ: ["s"],
				ਹ: ["h"],
				ਕ: ["k"], ਖ: ["kh"], ਗ: ["g"], ਘ: ["gh"], ਙ: ["ng"],
				ਚ: ["c"], ਛ: ["ch"], ਜ: ["j"], ਝ: ["jh"], ਞ: ["ny"],
				ਟ: ["t"], ਠ: ["th"], ਡ: ["d"], ਢ: ["dh"], ਣ: ["n"],
				ਤ: ["t"], ਥ: ["th"], ਦ: ["d"], ਧ: ["dh"], ਨ: ["n"],
				ਪ: ["p"], ਫ: ["ph"], ਬ: ["b"], ਭ: ["bh"], ਮ: ["m"],
				ਯ: ["y"], ਰ: ["r"], ਲ: ["l"], ਵ: ["v", "w"], ੜ: ["r", "d"],
				ਸ਼: ["sh"], ਖ਼: ["x"], ਗ਼: ["g"], ਜ਼: ["z"],
				ਫ਼: ["f"], ਲ਼: ["l"], ਕ਼: ["q"]
			},
			matras: {
				"ਾ": ["aa"],
				"ਿ": ["i"], "ੀ": ["ee"],
				"ੁ": ["u"], "ੂ": ["oo"],
				"ੇ": ["e"], "ੈ": ["ai"],
				"ੋ": ["o"], "ੌ": ["au"],
				"ਂ": ["am", "an"], "ੰ": ["am", "an"], "ੱ": [""]
			}
		},
	},
	sounds: {
		hindi: {
			vowels: { 
				अ: ['ə'], आ: ['aː'], इ: ['ɪ'], ई: ['iː'], उ: ['ʊ'], ऊ: ['uː'], ऋ: ['rɪ'], 
				ए: ['eː'], ऐ: ['ɛː'], ओ: ['oː'], औ: ['ɔː'], अं: ['ə̃'], अः: ['əh'],
			},
			consonants: {
				क: ['k'], ख: ['kʰ'], ग: ['ɡ'], घ: ['ɡʱ'], ङ: ['ŋ'], 
				च: ['t͡ʃ'], छ: ['t͡ʃʰ'], ज: ['d͡ʒ'], झ: ['d͡ʒʱ'], ञ: ['ɲ'], 
				ट: ['ʈ'], ठ: ['ʈʰ'], ड: ['ɖ'], ढ: ['ɖʱ'], ण: ['ɳ'], 
				त: ['t̪'], थ: ['t̪ʰ'], द: ['d̪'], ध: ['d̪ʱ'], न: ['n'], 
				प: ['p'], फ: ['pʰ'], ब: ['b'], भ: ['bʱ'], म: ['m'], 
				य: ['j'], र: ['ɾ'], ल: ['l'], व: ['ʋ'], श: ['ʃ'], 
				ष: ['ʂ'], स: ['s'], ह: ['ɦ'], 
				क़: ['q'], ख़: ['x'], ग़: ['ɣ'], ज़: ['z'], फ़: ['f'], 
				ड़: ['ɽ'], ढ़: ['ɽʱ'] 
			},
			matras: {
				"ा": ['aː'],
				"ि": ['ɪ'],
				"ी": ['iː'],
				"ु": ['ʊ'],
				"ू": ['uː'],
				"ृ": ['rɪ'],
				"े": ['eː'],
				"ै": ['ɛː'],
				"ो": ['oː'],
				"ौ": ['ɔː'],
				"ं": ['ə̃'],
				"ः": ['əh']
			}
		},
		punjabi: {
			vowels: {
				ੳ: ["-"], ੲ: ["-"],
				ਅ: ["ə"], ਆ: ["aː"], ਇ: ["ɪ"], ਈ: ["iː"], ਉ: ["ʊ"], ਊ: ["uː"],
				ਏ: ["eː"], ਐ: ["ɛː"], ਓ: ["oː"], ਔ: ["ɔː"]
			},
			consonants: {
				ਸ: ["s"], ਹ: ["ɦ"],
				ਕ: ["k"], ਖ: ["kʰ"], ਗ: ["ɡ"], ਘ: ["ɡʱ"], ਙ: ["ŋ"],
				ਚ: ["t͡ʃ"], ਛ: ["t͡ʃʰ"], ਜ: ["d͡ʒ"], ਝ: ["d͡ʒʱ"], ਞ: ["ɲ"],
				ਟ: ["ʈ"], ਠ: ["ʈʰ"], ਡ: ["ɖ"], ਢ: ["ɖʱ"], ਣ: ["ɳ"],
				ਤ: ["t̪"], ਥ: ["t̪ʰ"], ਦ: ["d̪"], ਧ: ["d̪ʱ"], ਨ: ["n"],
				ਪ: ["p"], ਫ: ["pʰ"], ਬ: ["b"], ਭ: ["bʱ"], ਮ: ["m"],
				ਯ: ["j"], ਰ: ["ɾ"], ਲ: ["l"], ਵ: ["ʋ"], ੜ: ["ɽ"],
				ਸ਼: ["ʃ"], ਖ਼: ["x"], ਗ਼: ["ɣ"], ਜ਼: ["z"], ਫ਼: ["f"],
				ਲ਼: ["ɭ"], ਕ਼: ["q"]
			},
			matras: {
				'ਾ': ['aː'],
				'ਿ': ['ɪ'],
				'ੀ': ['iː'],
				'ੁ': ['ʊ'],
				'ੂ': ['uː'],
				'ੇ': ['eː'],
				'ੈ': ['ɛː'],
				'ੋ': ['oː'],
				'ੌ': ['ɔː'],
				'ਂ': ['ə̃'],
				'ੰ': ['ə̃'],
				'ੱ': ['ː']
			}
	  }
	},
	pronunciations: {
		hindi: {
			vowels: {
				अ: ['', 'a', 'bout'],  आ: ['f', 'a', 'ther'],  इ: ['s', 'i', 't'],     ई: ['m', 'ee', 't'],
				उ: ['p', 'u', 't'],    ऊ: ['m', 'oo', 'n'],    ऋ: ['', 'ri', 'p'],
				ए: ['s', 'ay', ''],    ऐ: ['b', 'e', 'd'],     ओ: ['b', 'oa', 't'],   औ: ['l', 'aw', ''],
				अं: ['fi', 'n', 'ger'],  अः: ['similar to अ, but with a breathy h sound afterwards', '', '']
			},
			consonants: {
				क: ['s', 'k', 'y'],        ख: ['bloc', 'kh', 'ead'],  ग: ['', 'g', 'o'],         घ: ['do', 'gh', 'ouse'],    ङ: ['si', 'ng', ''],
				च: ['', 'ch', 'air'],      छ: ['bea', 'chh', 'ead'],  ज: ['', 'j', 'am'],        झ: ['he', 'dgeh', 'og'],   ञ: ['ca', 'ny', 'on'],
				ट: ['s', 't', 'op'],       ठ: ['po', 'th', 'ole'],    ड: ['', 'd', 'og'],        ढ: ['re', 'dh', 'ead'],    ण: ['cor', 'n', 'er'],
				त: ['s', 't', 'yle'],      थ: ['', 't', 'in'],   			द: ['o', 'th', 'er'],      ध: ['a', 'dh', 'ere'],    न: ['', 'n', 'ot'],
				प: ['s', 'p', 'in'],       फ: ['u', 'ph', 'ill'],     ब: ['', 'b', 'all'],       भ: ['clu', 'bh', 'ouse'],   म: ['', 'm', 'an'],
				य: ['', 'y', 'es'],        र: ['bu', 'tt', 'er'],     ल: ['', 'l', 'ip'],        व: ['', 'v', 'an'],
				श: ['', 'sh', 'ip'],       ष: ['pu', 'sh', ''],       स: ['', 's', 'un'],        ह: ['a', 'h', 'ead'],
				क़: ['similar to क, but in the back of the throat', '', ''],        ख़: ['lo', 'ch', ' (Scottish)'],       ग़: ['similar to ग, but air is released and not blocked', '', ''],       ज़: ['', 'z', 'oo'],       फ़: ['', 'f', 'un'],
				ड़: ['la', 'dd', 'er (with the tip of your tongue curled)'],     ढ़: ['similar to ड़, but with a breathy h sound afterwards', '', '']
			}
		},
		punjabi: {
			vowels: {
				ੳ: ['silent vowel carrier; takes the sound of the vowel attached to it', '', ''],
				ੲ: ['silent vowel carrier; takes the sound of the vowel attached to it', '', ''],
				ਅ: ['', 'a', 'bout'],  ਆ: ['f', 'a', 'ther'],  ਇ: ['s', 'i', 't'],   ਈ: ['m', 'ee', 't'],
				ਉ: ['p', 'u', 't'],    ਊ: ['m', 'oo', 'n'],
				ਏ: ['s', 'ay', ''],    ਐ: ['b', 'e', 'd'],     ਓ: ['b', 'oa', 't'], ਔ: ['l', 'aw', '']
			},
			consonants: {
				ਸ: ['', 's', 'un'],        ਹ: ['a', 'h', 'ead'],
				ਕ: ['s', 'k', 'y'],        ਖ: ['bloc', 'kh', 'ead'],  ਗ: ['', 'g', 'o'],         ਘ: ['do', 'gh', 'ouse'],   ਙ: ['si', 'ng', ''],
				ਚ: ['', 'ch', 'air'],      ਛ: ['bea', 'chh', 'ead'],  ਜ: ['', 'j', 'am'],        ਝ: ['he', 'dgeh', 'og'],   ਞ: ['ca', 'ny', 'on'],
				ਟ: ['s', 't', 'op'],       ਠ: ['po', 'th', 'ole'],    ਡ: ['', 'd', 'og'],        ਢ: ['re', 'dh', 'ead'],    ਣ: ['cor', 'n', 'er'],
				ਤ: ['s', 't', 'yle'],      ਥ: ['', 't', 'in'],        ਦ: ['o', 'th', 'er'],      ਧ: ['a', 'dh', 'ere'],     ਨ: ['', 'n', 'ot'],
				ਪ: ['s', 'p', 'in'],       ਫ: ['u', 'ph', 'ill'],     ਬ: ['', 'b', 'all'],       ਭ: ['clu', 'bh', 'ouse'],  ਮ: ['', 'm', 'an'],
				ਯ: ['', 'y', 'es'],        ਰ: ['bu', 'tt', 'er'],     ਲ: ['', 'l', 'ip'],        ਵ: ['', 'v', 'an'],
				ੜ: ['la', 'dd', 'er (with the tip of your tongue curled)'],
				ਸ਼: ['', 'sh', 'ip'],       ਖ਼: ['lo', 'ch', ' (Scottish)'],
				ਗ਼: ['similar to ਗ, but air is released and not blocked', '', ''],
				ਜ਼: ['', 'z', 'oo'],        ਫ਼: ['', 'f', 'un'],
				ਲ਼: ['similar to ਲ, but with the tip of your tongue curled back', '', ''],
				ਕ਼: ['similar to ਕ, but in the back of the throat', '', '']
			}
  	}
	}
}